<!doctype html>
<html lang="en">
<head>
    <meta charset="UTF-8">
    <meta name="viewport"
          content="width=device-width, user-scalable=no, initial-scale=1.0, maximum-scale=1.0, minimum-scale=1.0">
    <meta http-equiv="X-UA-Compatible" content="ie=edge">
    <link rel="stylesheet" href="../src/css/style.css"/>
    <title>Введение</title>
</head>
<body>
<?php include 'menu.php'; ?>

<h1>Введение</h1>

<div class="text">
    <p> Паска́ль (англ. Pascal) — один из наиболее известных языков программирования, используется для обучения
        программированию в старших классах и на первых курсах вузов, является основой для ряда других языков. </p>
    <p> Язык был создан Никлаусом Виртом в 1968—1969 годах . Однако назван он в честь французского математика, физика,
        литератора и философа Блеза Паскаля, который создал одну из первых в мире механических машин, складывающую два
        числа. Первая публикация Вирта о языке датирована 1970 годом; представляя язык, автор в качестве цели его
        создания указывал построение небольшого и эффективного языка, способствующего хорошему стилю программирования,
        использующему структурное программирование и структурированные данные. Последующая работа Вирта была направлена
        на создание на основе Паскаля языка системного программирования, с сохранением возможности вести на его базе
        систематический, целостный курс обучения профессиональному программированию. Результат этой работы — язык
        Модула-2. Одной из целей создания языка Паскаль Никлаус Вирт считал обучение студентов структурному
        программированию. </p>
</div>
</body>
</html>

